matt-garman/mcu-bypass-firmware/src/bypass_mcu_pic12f675.c
// SPDX-License-Identifier: MIT
// Copyright (c) Matthew Garman


// PIC12F675 hardware shell (Microchip XC8 toolchain).
//
// PIC12F675-near equivalent of bypass_mcu_pic10f322.c:
//     - implements bypass_hw_iface.h contract
//     - provides main(), CONFIG bits, and tick/watchdog model
//     - in Microchip jargon: pic12f675 is "classic-mid-range"; pic10f32x is
//       "enhanced-mid-range"
//     - note the peripheral set between 12f6xx and 10f32x differs, so a separate
//       shell is required
//
// Tick/WDT model "B" (see docs/phase2_pic_shell.md): a hardware timer (TMR0)
// drives a ~1ms tick that is POLLED in the main loop (no sleep); the watchdog
// is a pure FAULT watchdog at ~288ms, CLRWDT'd once per tick. There is no timer
// ISR and no ISR/main handshake: the single polled loop reaching CLRWDT is
// itself the liveness proof.
//
// Note the tick is 1.024ms, not 1.000ms; this is deliberate. OPTION_REG.PSA
// assigns the ONE prescaler to EITHER TMR0 OR the watchdog, never both, and
// this part has no period register anywhere (no TMR2/PR2, no CCP). Giving the
// prescaler to TMR0 would leave the WDT at its 18ms nominal base period. That
// value exceeds a 12ms relay pulse plus one 1.024ms tick; the safety decision
// instead rests on the 10ms characterized minimum, which is shorter than the
// normal pet-to-pet path once loop overhead is included. So the prescaler goes
// to the WDT (PSA=1, PS=1:16 -> 288ms nominal, 160ms minimum), and TMR0 runs
// unprescaled at Fosc/4 = 1MHz, rolling over every 256us; four rollovers counted
// in software make the 1.024ms tick. The 2.4% stretch changes nothing in the
// pure core (which counts samples, not milliseconds), but it changes every
// physical timing figure. See docs/pic12f675_feasibility.md section 4.4.1.
//
// CONFIG / fuse rationale (PIC analogue of the AVR fuse table in the AVR shell):
//   FOSC=INTRCIO internal 4MHz INTOSC with I/O on BOTH GP4 and GP5 -- required,
//                since GP5 is the footswitch (the CLKIN pin function must be
//                released). This part has no OSCCON and no runtime frequency
//                select: 4MHz is fixed in silicon, trimmed by OSCCAL.
//   WDTE=ON      watchdog cannot be disabled by software (EMI/SEU resilience);
//                period set to ~288ms via OPTION_REG PSA/PS at runtime
//   PWRTE=ON     power-up timer: let the supply settle before code runs
//   MCLRE=OFF    GP3 is a digital spare input with an external ICSP-safe
//                pull-up; MCLR tied internally to VDD
//   BOREN=ON     brown-out reset enabled
//   CP=OFF       no program-memory code protection
//   CPD=OFF      no data-EEPROM code protection (the 128B EEPROM is unused;
//                this field has no PIC10F322 counterpart)
// Absent relative to the PIC10F322: LVP, WRT, BORV, LPBOR.
//
// BG note: CONFIG bits 13:12 (BG1:BG0, mask 0x3000) are the factory bandgap
// calibration and have no #pragma config setting in the device pack, so they
// take the CWORD default (0b11). They set the BOD/POR trip voltages and are
// programmed per device at the factory. Whether a programmer PRESERVES them is
// a silicon-only concern -- see docs/pic12f675_feasibility.md section 8 item 1.
//
// BOR note: the AVR uses a 4.3V BOD because the relay/MOSFET peripherals need
// >4V. The PIC12F675 BOR trip point is ~2.1V and, unlike the PIC10F322, this
// part has no BORV field -- there is not even a high/low choice. So the PIC
// CANNOT enforce a >4V floor in firmware; that is a hardware-design
// limitation, not a firmware one.
//
// OSCCAL note: the oscillator calibration value lives in the LAST program
// word (0x3FF, the pack's ".oscval" CalDataZone) as a RETLW, and XC8's
// startup code calls it. A bulk erase that does not preserve that word leaves
// an untrimmed oscillator, i.e. wrong tick cadence and wrong __delay_ms()
// coil-pulse widths on a device that still appears to work. The guarded
// pic12f675-program workflow rejects an image that explicitly programs word
// 0x3FF, requires a matching baseline and immediate pre-write read, and
// records mandatory post-write trim/readback evidence. It detects
// programmer-induced loss only after the write; real preservation remains
// hardware-unvalidated. See release/README.md and
// docs/pic12f675_feasibility.md section 8 item 2.



#include "bypass_config.h"        // PRESSED_THRESH / RELEASE_THRESH
#include "bypass_output_common.h" // -> bypass_pins_pic12f675.h (build defines -DBYPASS_MCU_PIC12F675)
#include "bypass_types.h"
#include "bypass_pure.h"
#include "bypass_hw_iface.h"
#include "bypass_static_assert.h" // static_assert()
#include "bypass_compile_checks.h"

#include <xc.h> // device SFRs, CLRWDT(), __delay_ms()

#include <stdint.h>


// CONFIG (configuration word, 0x2007)
#pragma config FOSC  = INTRCIO
#pragma config WDTE  = ON
#pragma config PWRTE = ON
#pragma config MCLRE = OFF
#pragma config BOREN = ON
#pragma config CP    = OFF
#pragma config CPD   = OFF


// Implemented-bit masks. This part has 6 I/O (GP0..GP5) so the port registers
// carry 6 implemented bits, unlike the PIC10F322's 4.
#define GPIO_IMPLEMENTED_MASK  (0x3FU) // GP0..GP5
#define WPU_IMPLEMENTED_MASK   (0x37U) // GP0,GP1,GP2,GP4,GP5 (GP3 has NO pull-up)

// ANSEL bit positions match GPIO for GP0..GP2, but ANS3 controls GP4:
// GPIO bit 4 therefore maps to ANSEL bit 3. All four output-capable analog pins
// must remain digital now that spare GP4 is a parked output.
#define ANSEL_OUTPUT_MASK      (0x0FU) // ANS0..ANS3 = GP0,GP1,GP2,GP4

// OPTION_REG, written as a whole and checked exactly. It carries THREE
// safety-relevant fields on this part, where the PIC10F322 spreads the same
// state across WDTCON, PR2/T2CON and OPTION_REG:
//   nGPPU  = 0     bit 7  global weak pull-ups ENABLED (active low)
//   INTEDG = 0     bit 6  INT edge select; INT unused, pinned for exactness
//   T0CS   = 0     bit 5  TMR0 clocked from the instruction clock (Fosc/4)
//   T0SE   = 0     bit 4  TMR0 edge select; unused when T0CS=0
//   PSA    = 1     bit 3  prescaler assigned to the WATCHDOG, not TMR0
//   PS     = 0b100 bits 2:0  1:16 -> WDT ~288ms (18ms nominal base x 16)
#define OPTION_REG_CONFIG      (0x0CU)

// TMR0 is unprescaled at Fosc/4 = 1MHz, so it rolls over every 256us. Four
// rollovers make the 1.024ms tick.
#define TMR0_SUBTICKS_PER_TICK (4U)

// CMCON = 0x07 -> CM<2:0> = 111 = comparator OFF. MANDATORY: CM<2:0> = 000 out
// of reset ("Comparator Reset" mode) makes GP0/CIN+ and GP1/CIN- analog
// inputs, and an analog input ALWAYS READS 0 whatever the pin is driving. Two
// of this design's three active outputs are on GP0/GP1, so leaving CM<2:0> =
// 000 would fail the port-follows-shadow check on every tick. GP2 is not taken
// at reset; COUT reaches it in three of the eight modes, which is an upset
// path rather than the reset state. Parked GP4 has no comparator function.
#define CMCON_COMPARATOR_OFF   (0x07U)

// ADCON0 = 0x00 -> ADON = 0, ADC off.
#define ADCON0_ADC_OFF         (0x00U)



//////////////////////////////////////////////////////////////////////////////
// OUTPUT SHADOW LATCH
//////////////////////////////////////////////////////////////////////////////

// The classic mid-range core has NO LATx register. Reading GPIO returns the
// PHYSICAL PIN LEVELS, not the last value written, so the PIC10F322 idiom
//
//     LATA |= (uint8_t)(1U << pin);
//
// becomes a read-modify-write ON THE PINS if written against GPIO -- the
// classic PIC defect. A loaded output (an LED through a resistor, a relay
// coil, a pin still slewing) can read back a level different from the one
// written, and the write-back then corrupts OTHER bits in the same port.
//
// So every write goes shadow -> GPIO, and GPIO is never read-modify-written.
//
// The shadow is SRAM, which the project's cosmic-ray/EMI threat model says can
// flip. EVERY shadow upset, and every shadow/port mismatch, reaches the sanity
// gate: nothing re-drives the port ahead of that check, so the
// port-follows-shadow clause sees the port exactly as the previous tick left
// it. An unexpectedly energized coil is therefore escalated rather than
// silently refreshed, and hw_outputs_reassert_safe() de-energizes both coils
// on the way into the reset -- alongside parked GP4, because the one write
// that publishes the cleared coils publishes every other shadow bit with them.
static uint8_t gpio_shadow_;

// Snapshot of the factory oscillator trim, captured in hw_mcu_init() and
// re-checked every tick. This part has no OSCCON, so there is no constant to
// compare against: OSCCAL is device-specific factory trim loaded from program
// word 0x3FF by XC8's startup code, and the only meaningful check is that it
// has not CHANGED since init. (Structurally the PIC10F322's OSCCON.IRCF guard,
// with a captured value where the 322 has a compile-time constant.)
static uint8_t osccal_snapshot_;


//////////////////////////////////////////////////////////////////////////////
// CROSS-BOUNDARY HW OPS (implement bypass_hw_iface.h)
//////////////////////////////////////////////////////////////////////////////

// LED_PIN high = status LED lit; low = dark. Outputs are written shadow->GPIO.
void hw_led_pin_set_high(void) {
    gpio_shadow_ |= (uint8_t)(1U << LED_PIN);
    GPIO = gpio_shadow_;
}
void hw_led_pin_set_low(void) {
    gpio_shadow_ &= (uint8_t)~(1U << LED_PIN);
    GPIO = gpio_shadow_;
}


