matt-garman/mcu-bypass-firmware/src/bypass_mcu_pic12f675.c
// - set a GPIO pin high or low
// - assumes pin was previously configured as output
void hw_pin_set_high(uint8_t const pin) {
    gpio_shadow_ |= (uint8_t)(1U << pin);
    GPIO = gpio_shadow_;
}
void hw_pin_set_low(uint8_t const pin) {
    gpio_shadow_ &= (uint8_t)~(1U << pin);
    GPIO = gpio_shadow_;
}
void hw_pin_mask_set_low(uint8_t const pin_mask) {
    gpio_shadow_ &= (uint8_t)~pin_mask;
    GPIO = gpio_shadow_;
}


// configure exactly the pins in output_mask as outputs (TRISIO bit = 0); all
// other pins are left as inputs (TRISIO bit = 1). The selected pins are made
// digital (ANSEL bit = 0, comparator and ADC off) and driven low (shadow and
// GPIO bit = 0). GP4 is therefore parked low with the active outputs. GP3 is
// input-only and always remains an input (its TRISIO bit reads 1).
//
// The comparator/ADC disable belongs HERE and not only in hw_mcu_init()
// because on this part "make these pins digital" genuinely requires it: with
// CM<2:0> = 000 out of reset GP0 and GP1 are comparator analog inputs, and an
// analog input reads back 0 no matter what the output driver is doing. TRISIO
// still controls direction, so a direction write DOES take effect; what it
// cannot fix is the readback, which would leave hw_output_state_intact()
// comparing a forced 0 against a set shadow bit. (The PIC10F322 has only
// ANSELA to clear.)
void hw_configure_output_pins(uint8_t const output_mask) {
    CMCON  = CMCON_COMPARATOR_OFF;                       // frees GP0/GP1, bars COUT on GP2
    ADCON0 = ADCON0_ADC_OFF;                             // ADC off
    // Do not mask ANSEL with output_mask: GPIO bit 4 maps to ANSEL bit 3.
    ANSEL &= (uint8_t)~ANSEL_OUTPUT_MASK;                // GP0..GP2/GP4 -> digital
    gpio_shadow_ &= (uint8_t)~output_mask;               // selected pins -> low (shadow)
    GPIO   = gpio_shadow_;                               // ... and on the port
    TRISIO = (uint8_t)((uint8_t)~output_mask & GPIO_IMPLEMENTED_MASK);
}


// sanity-check utility: return non-zero ("true") IFF the complete direction
// configuration still matches initialization, every pin in
// required_output_mask is still configured as an output (its TRISIO direction
// bit is still 0), the output shadow matches the expected state, AND the
// physical port still follows the shadow.
//
// Exact TRISIO protects GP0..GP2 and parked-spare GP4 as outputs, and GP3/GP5
// as inputs. The expected value is the six implemented direction bits minus
// the configured outputs (0x3F ^ 0x17 = 0x28).
//
// The shadow-vs-port comparison is STRONGER than anything the PIC10F322 can
// do. The 322 compares its LATA latch against the expected mask and stops
// there; with a shadow it becomes possible to compare intent against reality
// as well, which catches a class of fault the 322 cannot see at all: a driver,
// pin or bus fault where the port does not follow the latch.
uint8_t hw_output_state_intact(
        uint8_t const required_output_mask,
        uint8_t const expected_high_mask) {

    uint8_t expected_direction_mask =
        (uint8_t)(GPIO_IMPLEMENTED_MASK ^ BYPASS_OUTPUT_DDR_MASK); // = 0x28
    uint8_t actual_direction_mask = (uint8_t)(TRISIO & GPIO_IMPLEMENTED_MASK);
    uint8_t shadow_high_mask =
        (uint8_t)(gpio_shadow_ & (uint8_t)BYPASS_OUTPUT_DDR_MASK);
    uint8_t port_high_mask =
        (uint8_t)(GPIO & (uint8_t)BYPASS_OUTPUT_DDR_MASK);

    return
        (actual_direction_mask == expected_direction_mask) &&
        (0U == (actual_direction_mask & required_output_mask)) &&
        (shadow_high_mask == expected_high_mask) &&
        (port_high_mask   == shadow_high_mask);
}


// sanity-check utility: return non-zero ("true") IFF all the critical pin
// values are what we want
// SFR = special function register, the "control panel" of the MCU
static uint8_t hw_critical_sfrs_intact(void) {

    // OPTION_REG is checked EXACTLY, and that one comparison covers three
    // safety-relevant fields at once: the watchdog period (PSA/PS), the tick
    // clock source (T0CS/T0SE) and the global weak-pull-up enable (nGPPU).
    // On the PIC10F322 an upset to those is three independent events in three
    // registers (WDTCON, T2CON/PR2, OPTION_REG); here they are three fields in
    // ONE byte, so a single-bit upset is MORE likely to hit something
    // safety-relevant -- and one exact comparison covers all of it.
    //
    // CMCON: CM<2:0> = 000 out of reset makes GP0 and GP1 comparator analog
    // inputs, which read back 0 whatever they drive; three of the eight modes
    // additionally put COUT on GP2. All three are active outputs here, so any
    // CM<2:0> but 111 breaks the port-follows-shadow check. Only the low three
    // bits are checked: COUT (6) and CINV (4) are not meaningful with the
    // comparator disabled.  (Parked GP4 has no comparator function.)
    //
    // ADCON0.ADON: same class of hazard as CMCON -- an upset that turns the
    // ADC on takes an output pin analog.
    //
    // ANSEL: masked to ANS0..ANS3, which select GP0, GP1, GP2 and GP4. GP4 is
    // now a parked output, so ANS3 must remain clear and guarded. This cannot
    // use BYPASS_OUTPUT_DDR_MASK directly because GPIO bit 4 maps to ANSEL bit
    // 3. Bits 6:4 are ADC clock-select fields and do not matter with ADON=0.
    //
    // OSCCAL: compared against the value captured at init, not a constant --
    // it is factory trim (see osccal_snapshot_).

    uint8_t option  = (uint8_t)OPTION_REG;
    uint8_t cmcon   = (uint8_t)(CMCON & 0x07U);
    uint8_t adon    = (uint8_t)ADCON0bits.ADON;
    uint8_t ansel   = (uint8_t)(ANSEL & ANSEL_OUTPUT_MASK);
    uint8_t osccal  = (uint8_t)OSCCAL;

    return
        (OPTION_REG_CONFIG    == option) &&
        (CMCON_COMPARATOR_OFF == cmcon)  &&
        (0U                   == adon)   &&
        (0U                   == ansel)  &&
        (osccal_snapshot_     == osccal);
}



//////////////////////////////////////////////////////////////////////////////
// SHELL-INTERNAL HELPERS (file-static; NOT part of bypass_hw_iface.h)
//////////////////////////////////////////////////////////////////////////////

static void hw_emergency_outputs_quiesce(void) {
#if defined(TQ2_L2_5V_RELAY)
    uint8_t const coil_mask =
        (uint8_t)((uint8_t)(1U << RELAY_RESET_PIN) |
                (uint8_t)(1U << RELAY_SET_PIN));

    WPU &= (uint8_t)~coil_mask;
    TRISIO |= coil_mask;
    ADCON0 = ADCON0_ADC_OFF;
    ANSEL &= (uint8_t)~ANSEL_OUTPUT_MASK;
    CMCON = CMCON_COMPARATOR_OFF;
    // Canonicalize the parked spare BEFORE the driver's clear, in the SHADOW
    // ONLY (no GPIO write of its own). hw_outputs_reassert_safe() clears the
    // two coil intents and then publishes the WHOLE shadow in one write, so a
    // GP4 intent bit left set by an upset would be converted from inert SRAM
    // into a driven pad for the length of the watchdog period -- the escalation
    // path would create the very hazard it exists to remove. The fix cannot be
    // a second single-pin GPIO write: two sequential whole-port writes can
    // replay the other corrupt coil bit between them, which is exactly what
    // the one-write guarantee below exists to prevent. One write, with every
    // safety-constrained output (both coils and parked GP4) already low in the
    // shadow it publishes.
    gpio_shadow_ &= (uint8_t)~(uint8_t)(1U << SPARE_OUTPUT_PIN);
    hw_outputs_reassert_safe();
    TRISIO &= (uint8_t)~coil_mask;
#else
    hw_outputs_reassert_safe();
#endif
}


// infinite loop to force a WDT reset on a critical, unrecoverable event
// (cosmic ray / extreme EMI). Quiesces hazardous outputs first, then disables
// interrupts so nothing can pet the dog during the watchdog spin. Relies on
// the fuse-locked WDT being active (it always is on this part).
//
// First: hw_emergency_outputs_quiesce() (and hw_outputs_reassert_safe(),
// implicitly): any output with a continuous-energization hazard (the relay
// coils) is driven to its de-energized idle BEFORE the spin, so no fault can
// hold a coil energized for the length of the watchdog period. Having no LATx,
// this part commits that clear as ONE whole-port write of the shadow, so the
// same step also canonicalizes parked GP4 -- an output the board contract
// permits only while it is low, and whose corrupt SRAM intent would otherwise
// be published to the pad by that write. The reset then re-runs init(), whose
// full-width BYPASS actuation re-synchronizes the physical relay with the
// logical state and the LED.
__attribute__((noreturn)) static void hw_force_wdt_reset(void) {
    hw_emergency_outputs_quiesce(); // calls hw_outputs_reassert_safe()
    INTCONbits.GIE = 0;
    for (;;) { }
}


// read FOOTSW_PIN (GP5) to determine if it's high or low
//   FOOTSW_PIN high = switch open/released
//   FOOTSW_PIN low  = switch closed/pressed
// returns: PIN_STATE_HIGH or PIN_STATE_LOW
//
// Reads GPIO, which on this core returns the physical pin level -- exactly
// what is wanted for an input pin (the shadow is for OUTPUT writes only).
static pin_state_t hw_read_footswitch(void) {
    return (0U == (GPIO & (uint8_t)(1U << FOOTSW_PIN))) ?
        PIN_STATE_LOW :
        PIN_STATE_HIGH;
}


// non-zero IFF the footswitch weak pull-up is genuinely active. The PIC weak
// pull-up has a TWO-part enable: the per-pin WPU latch AND the global,
// active-low OPTION_REG.nGPPU. An SEU/EMI flip of EITHER silently disables the
// pull-up, so both are checked. (The AVR analogue checks the single PORTB latch
// bit that IS its pull-up enable; checking both here restores SEU-detection
// parity under the project's cosmic-ray/EMI threat model.)
//
// The WPU mask is 0x37, not 0x3F: this part implements WPU bits 0,1,2,4,5 and
// has NO bit 3, because GP3 has no internal weak pull-up. That absence is the
// reason the footswitch is on GP5 rather than on the input-only pin the
// PIC10F322 uses -- see bypass_pins_pic12f675.h.
//
// The two volatile SFRs are read into locals first so the && combines two plain
// (non-volatile) booleans: this keeps MISRA Rule 13.5 clean (no persistent side
// effect on the right operand of &&), which the project does not deviate.
static uint8_t hw_footswitch_pullup_intact(void) {

    // Exact pull-up configuration integrity: GP5 latch set, all other
    // implemented latches clear, and global weak pull-ups enabled. Extra
    // output-pin latches are faults because a TRISIO upset would make them
    // electrically active.

    uint8_t wpu_latches = (uint8_t)(WPU & WPU_IMPLEMENTED_MASK);
    uint8_t wpu_global  = (uint8_t)OPTION_REGbits.nGPPU; // 0 = enabled

    return
        (wpu_latches == (uint8_t)(1U << FOOTSW_PIN)) &&
        (0U == wpu_global);
}


