matt-garman/mcu-bypass-firmware/src/bypass_mcu_pic12f675.c
// reset the WDT countdown ("pet the dog")
static void hw_wdt_pet(void) { CLRWDT(); }


// core MCU bring-up: all-digital port (comparator AND ADC off, not just the
// analog selects), the footswitch weak pull-up, the global weak-pull-up
// enable, the TMR0 clock source and the ~288ms watchdog period -- the last
// three all landing in the single OPTION_REG write. Finally captures the
// oscillator trim snapshot. Does NOT start the tick timer (see
// hw_tick_timer_start()).
//
// Ordering: call BEFORE hw_init_output_pins(). This is the OPPOSITE of the
// PIC10F322 shell, and for a reason specific to this part: CM<2:0> = 000 out
// of reset leaves GP0 and GP1 as comparator analog inputs, which read back 0
// regardless of what is driven. Configuring pin directions first would leave
// two of the three active outputs unreadable until CMCON is written. It is
// also the order the datasheet's own EXAMPLE 3-1 "INITIALIZING GPIO" uses:
// CMCON, then ANSEL, then TRISIO. (hw_configure_output_pins() re-asserts
// CMCON/ADCON0 for the same reason, so the ordering is belt-and-suspenders
// rather than load-bearing - but the order should still be the safe one.)
//
// There is no clock-select write here and no OSCCON on this part: the
// oscillator is a fixed 4MHz INTOSC selected by FOSC=INTRCIO in CONFIG,
// trimmed by the factory OSCCAL value that XC8's startup code loads from
// program word 0x3FF.
static void hw_mcu_init(void) {

    // entire port digital. THREE registers, where the PIC10F322 has one: the
    // comparator (CM<2:0> = 000 out of reset, holding GP0 and GP1 analog),
    // the ADC, and the analog selects.  Each is an independent
    // single-event-upset path to "the firmware still thinks it owns a digital
    // output but an analog peripheral has taken it", and each is guarded per
    // tick in hw_critical_sfrs_intact().
    CMCON  = CMCON_COMPARATOR_OFF; // CM<2:0> = 111: comparator off
    ADCON0 = ADCON0_ADC_OFF;       // ADON = 0
    ANSEL  = 0x00U;                // ANS0..ANS3 digital (also zeroes ADCS, unused)

    // Enable the footswitch (GP5) input pull-up; FOOTSW_PIN high = released,
    // low = pressed. GP3's required pull-up is external because WPU3 does not
    // exist. GP4 is an output and therefore receives no pull-up latch.
    WPU = (uint8_t)(1U << FOOTSW_PIN);

    // One write configures the global pull-up enable, the TMR0 clock source
    // and the watchdog period -- see OPTION_REG_CONFIG above.
    //
    // PSA = 1 assigns the shared prescaler to the WDT; PS = 0b100 = 1:16,
    // giving 288ms nominal (18ms x 16). DS41190G Table 12-4 parameter 31 gives
    // a 10ms unprescaled minimum, so the characterized minimum here is 160ms.
    // This is the closest analogue to the PIC10F322's ~256ms and the AVR
    // shell's 250ms. The worst-case pet-to-pet window WDT_PET_TO_PET_MAX_MS()
    // asserts is the longest blocking actuation -- the 12ms relay coil pulse --
    // plus one tick of scheduling latency and one pass of bounded loop work:
    // 16ms with this map's conservative 2ms ceiling on the 1.024ms tick,
    // comfortably below the 160ms minimum. The prescaler choice therefore
    // retains ample margin at the fast WDT end.
    OPTION_REG = OPTION_REG_CONFIG;

    // Capture the factory oscillator trim AFTER bring-up, for the per-tick
    // comparison in hw_critical_sfrs_intact(). NOTE this snapshots whatever is
    // in OSCCAL, including garbage: it detects a LATER change, and cannot
    // detect a device programmed with word 0x3FF erased. That is a programming
    // -procedure concern, not a runtime one.
    osccal_snapshot_ = (uint8_t)OSCCAL;
}


// configure + start the 1.024ms tick on TMR0, polled (no interrupt).
//
// TMR0's clock source and (absent) prescaler were already set by the single
// OPTION_REG write in hw_mcu_init(): T0CS=0 selects the instruction clock
// (Fosc/4 = 1MHz at 4MHz INTOSC) and PSA=1 gives the shared prescaler to the
// watchdog, so TMR0 counts unprescaled and rolls over every 256 counts =
// 256us. There is no period register on this part, so the 1.024ms tick is four
// rollovers counted in software by hw_wait_for_tick().
//
// MUST run AFTER any blocking output actuation so a T0IF that set during init
// is not mistaken for the first real tick.
static void hw_tick_timer_start(void) {
    TMR0 = 0U;             // start the first sub-tick from a known count
    INTCONbits.T0IF = 0;   // start clean
}


// pause until the next 1.024ms tick, then clear the flag. The AVR sleeps here;
// the PIC polls (Model B, no sleep) -- same contract, hence the shared name.
//
// UNLIKE the PIC10F322's single TMR2IF wait, this polls T0IF four times,
// because TMR0 has no period register and rolls over every 256us. The inner
// loop does NOT disturb the max-block invariant: the blocking quantity is
// still the actuation delay, not the tick.
static void hw_wait_for_tick(void) {
    uint8_t subticks = 0U;
    while (subticks < TMR0_SUBTICKS_PER_TICK) {
        while (0U == INTCONbits.T0IF) { }
        INTCONbits.T0IF = 0;
        subticks++;
    }
}


//////////////////////////////////////////////////////////////////////////////
// PROGRAM GLOBALS
//////////////////////////////////////////////////////////////////////////////

// Persisted debounce context. The PIC has no ISR, but volatile is load-bearing
// for the F2 transaction: each tick must take one real snapshot and publish one
// real successor rather than let the compiler reuse live global values.
static volatile debounce_context_t ctx_;

#if defined(BYPASS_CTX_CHECK)
// debounce_context_t checksum; see debounce_ctx_check_word()
static volatile uint8_t ctx_check_;
#endif


//////////////////////////////////////////////////////////////////////////////
// INIT + MAIN
//////////////////////////////////////////////////////////////////////////////

// high-level initialization
// called at power-on, and after a reset (e.g. brown-out or watchdog timeout)
static void init(void) {

    // pin-map sanity: the PIC pin map hard-codes GPIO bit positions as literals.
    // Pin them at compile time against the DFP's _GPIO_GPx_POSN
    // so a typo in the map or a DFP change can never silently misroute a pin
    // (parity with the AVR shell's PBx asserts).
    static_assert(FOOTSW_PIN      == _GPIO_GP5_POSN, "FOOTSW_PIN must be GP5");
    static_assert(LED_PIN         == _GPIO_GP0_POSN, "LED_PIN must be GP0");
    static_assert(CD4053_PIN      == _GPIO_GP1_POSN, "CD4053_PIN must be GP1");
    static_assert(RELAY_RESET_PIN == _GPIO_GP1_POSN, "RELAY_RESET_PIN must be GP1");
    static_assert(RELAY_SET_PIN   == _GPIO_GP2_POSN, "RELAY_SET_PIN must be GP2");
    static_assert(CD4053_CTL1     == _GPIO_GP1_POSN, "CD4053_CTL1 must be GP1");
    static_assert(CD4053_CTL2     == _GPIO_GP2_POSN, "CD4053_CTL2 must be GP2");
    static_assert(SPARE_INPUT_PIN == _GPIO_GP3_POSN,
        "SPARE_INPUT_PIN must be input-only GP3");
    static_assert(SPARE_OUTPUT_PIN == _GPIO_GP4_POSN,
        "SPARE_OUTPUT_PIN must be GP4");

    static_assert(0U == ((1U << SPARE_INPUT_PIN) & WPU_IMPLEMENTED_MASK),
        "SPARE_INPUT_PIN must use the external pull-up because GP3 has no WPU");
    static_assert(0U == ((1U << SPARE_INPUT_PIN) & BYPASS_OUTPUT_DDR_MASK),
        "SPARE_INPUT_PIN must remain an input");
    static_assert(0U != ((1U << SPARE_OUTPUT_PIN) & BYPASS_OUTPUT_DDR_MASK),
        "SPARE_OUTPUT_PIN must be a guarded low-driven output");

    // The footswitch pin must be one the silicon can weakly pull up. GP3 has no
    // WPU bit on this part, which is exactly why the map differs from the
    // PIC10F322's; assert it rather than trusting the comment.
    static_assert(0U != ((1U << FOOTSW_PIN) & WPU_IMPLEMENTED_MASK),
        "FOOTSW_PIN must have an implemented weak pull-up (GP3 does not)");

    // The footswitch must not collide with the output pins.
    static_assert(0U == ((1U << FOOTSW_PIN) & BYPASS_OUTPUT_DDR_MASK),
        "FOOTSW_PIN must not be one of the output pins");

    // _XTAL_FREQ (a build flag, used by the drivers' __delay_ms) must match the
    // fixed 4MHz INTOSC, or the coil/mute pulse widths would be wrong. Unlike
    // the PIC10F322 there is nothing to select at runtime: FOSC=INTRCIO in
    // CONFIG is the whole story.
    static_assert(_XTAL_FREQ == 4000000UL, "_XTAL_FREQ must be 4 MHz (fixed INTOSC)");


