matt-garman/mcu-bypass-firmware/src/bypass_mcu_pic12f675.c
    // Pet the WDT first thing, mirroring the AVR shell's "re-arm first". Unlike
    // the AVR -- whose WDTCR collapses to the ~16ms minimum after a WDRF,
    // creating a short post-reset reset-loop hazard -- the PIC has no such
    // window: WDTE=ON runs the WDT from reset with OPTION_REG at its POR
    // default of 0xFF, i.e. PSA=1 and PS=0b111 = 1:128 = ~2.3s, which dwarfs
    // init() + the <=12ms bypass pulse. hw_mcu_init() narrows the period to
    // ~288ms afterward. This early pet is therefore belt-and-suspenders, not
    // required -- it documents why no early arming is needed and costs one
    // instruction.
    hw_wdt_pet(); // i.e., CLRWDT()


    // clock-independent bring-up FIRST on this part: GP0 and GP1 come out of
    // reset as comparator analog inputs, so the analog peripherals must be
    // turned off before a driven pin reads back what was written. (The
    // PIC10F322 shell orders these the other way; see hw_mcu_init().)
    hw_mcu_init();

    // driver: set pin directions (TRISIO/ANSEL/shadow+GPIO for the active variant)
    hw_init_output_pins();

    // driver: default to bypass (may block on the relay/mute pulse, which is
    // shorter than one WDT period)
    hw_set_bypass_state();

    // Build one intended initial context, then publish its check and bytes.
    // XC8 rejects a runtime-initialized const local, so this is non-const.
    debounce_context_t next_ctx =
        debounce_init_context(hw_read_footswitch());

#if defined(BYPASS_CTX_CHECK)
    ctx_check_ = debounce_ctx_check_word(next_ctx);
#endif
    ctx_ = next_ctx;

    // LAST: start + clear the tick, immediately before the loop, so no rollover
    // accumulated during init is mistaken for the first real tick.
    hw_tick_timer_start();
}


// program entry point. Model B: a single polled 1.024ms loop. Each tick we
// sample + integrate the footswitch and advance the debounce state machine;
// CLRWDT at the end of every iteration is the main-loop liveness proof.
void main(void) {

    init(); // note: initializes ctx_ via debounce_init_context()

    for (;;) {

        // pause until the next 1.024ms TMR0 tick (polled; no sleep on Model B)
        hw_wait_for_tick();
        debounce_context_t next_ctx = ctx_;

        // basic sanity checks against outlier events (cosmic rays, extreme EMI);
        // always checked, regardless of state; force a WDT reset on any
        // violation. (No timer_isr_called_ guard as on AVR -- the PIC has no
        // ISR; main-loop liveness is proven by reaching hw_wdt_pet() below.)
        if (
#if defined(BYPASS_CTX_CHECK)
                (ctx_check_ != debounce_ctx_check_word(next_ctx)) ||
#endif
                (next_ctx.program_state > RELEASE_DEBOUNCE_WAIT) ||
                (next_ctx.debounce_counter > RELEASE_THRESH) ||
                (next_ctx.effect_state > ENGAGED) ||
                // assert footswitch pull-up still enabled
                (0U == hw_footswitch_pullup_intact()) ||
                // config-specific runtime sanity checks
                hw_is_sanity_check_failed(next_ctx.effect_state) ||
                (0U == hw_critical_sfrs_intact())
           ) {
            hw_force_wdt_reset();
        }

        // sample + integrate this tick (in the main loop, not an ISR)
        next_ctx.debounce_counter = debounce_integrate(
                hw_read_footswitch(),
                next_ctx.debounce_counter);

        // advance the debounce state machine.
        // NOTE: NOT const-qualified (unlike the AVR shell). XC8 places
        // const-qualified objects in program ROM, so a const local initialized
        // from a runtime call is rejected ("initializer element is not a
        // compile-time constant"). A required PIC/XC8 deviation.
        debounce_step_result_t res = debounce_step(next_ctx);

        next_ctx.program_state = res.program_state;
        next_ctx.effect_state  = res.effect_state;
        if (res.reload_lockout) {
            next_ctx.debounce_counter = res.lockout_value;
        }
#if defined(BYPASS_CTX_CHECK)
        // Derive from the validated intended successor, never live persisted
        // SRAM: a post-snapshot upset is overwritten or remains a mismatch.
        ctx_check_ = debounce_ctx_check_word(next_ctx);
#endif
        ctx_ = next_ctx;

        // note: the fault condition is defense-in-depth/belt-and-suspenders with
        // the sanity checks above
        if (res.fault) {
            hw_force_wdt_reset();
        }
        else if (res.toggled) {
            if (BYPASS == res.effect_state) { hw_set_bypass_state(); }
            else /*ENGAGED == res.effect_state*/ { hw_set_engaged_state(); }
        }
        else {
            // state advanced this tick with no toggle and no fault: nothing to do
        }

        // pet the dog: completing the loop body proves main() is alive
        hw_wdt_pet(); // i.e. CLRWDT()
    }
}
